package lesson9;

public class Main2 {
    public static void main(String[] args) {
        String[][] db = {
                // страна, стоимость, сколько добираться, звезд,     на чем
                {"Турция", "50000", "3", "4 звезды", "самолет"},
                {"Турция", "80000", "4", "5 звезд", "самолет"},
                {"Египет", "70000", "6", "3 звезды", "самолет"},
                {"ОАЭ", "120000", "5", "4 звезды", "самолет"},
                {"Кипр", "100000", "4", "4 звезды", "самолет"},
                {"Сочи", "50000", "12", "2 звезды", "автобусе"},
                {"Байкал", "100000", "24", "4 звезды", "поезде"},
                {"германия", "60000", "15", "5 звезд", "поезде"}
        };

//сколько добираться
//сортировка по звездам (передаем число)
//на чем добираться
//
//

        String[][] turs = TurUtils.turByCountryAndPrice(db, "Турция", 70000, 100000);
        for (int i = 0; i < turs.length; i++) {

                System.out.printf("Тур: %s, Стоимость %s, добираться %s, %s, добираться на %s\n",
                        turs[i][0], turs[i][1], turs[i][2], turs[i][3], turs[i][4]);

        }


    }
}
